benchmark_results/container_logs/cassandra-client-warmup.log
======================================================
server IP: localhost
Fill the database with 5000000 records
Load generator threads count: 4
======================================================
======================================================
Creating a usertable for the seed server
======================================================
Connection error: ('Unable to connect to any servers', {'127.0.0.1:9042': ConnectionRefusedError(111, "Tried connecting to [('127.0.0.1', 9042)]. Last error: Connection refused")})
Cannot connect to the seed server. Trying again...
Connection error: ('Unable to connect to any servers', {'127.0.0.1:9042': ConnectionRefusedError(111, "Tried connecting to [('127.0.0.1', 9042)]. Last error: Connection refused")})
Cannot connect to the seed server. Trying again...
Connection error: ('Unable to connect to any servers', {'127.0.0.1:9042': ConnectionRefusedError(111, "Tried connecting to [('127.0.0.1', 9042)]. Last error: Connection refused")})
Cannot connect to the seed server. Trying again...
Connection error: ('Unable to connect to any servers', {'127.0.0.1:9042': ConnectionRefusedError(111, "Tried connecting to [('127.0.0.1', 9042)]. Last error: Connection refused")})
Cannot connect to the seed server. Trying again...
Connection error: ('Unable to connect to any servers', {'127.0.0.1:9042': ConnectionRefusedError(111, "Tried connecting to [('127.0.0.1', 9042)]. Last error: Connection refused")})
Cannot connect to the seed server. Trying again...
Connection error: ('Unable to connect to any servers', {'127.0.0.1:9042': ConnectionRefusedError(111, "Tried connecting to [('127.0.0.1', 9042)]. Last error: Connection refused")})
Cannot connect to the seed server. Trying again...
Connection error: ('Unable to connect to any servers', {'127.0.0.1:9042': ConnectionRefusedError(111, "Tried connecting to [('127.0.0.1', 9042)]. Last error: Connection refused")})
Cannot connect to the seed server. Trying again...

Warnings :
Your replication factor 3 for keyspace ycsb is higher than the number of nodes 1

======================================================
Populate the database
======================================================
/usr/bin/java  -classpath /ycsb/conf:/ycsb/lib/HdrHistogram-2.1.4.jar:/ycsb/lib/core-0.17.0.jar:/ycsb/lib/htrace-core4-4.1.0-incubating.jar:/ycsb/lib/jackson-core-asl-1.9.4.jar:/ycsb/lib/jackson-mapper-asl-1.9.4.jar:/ycsb/cassandra-binding/lib/cassandra-binding-0.17.0.jar:/ycsb/cassandra-binding/lib/cassandra-driver-core-3.0.0.jar:/ycsb/cassandra-binding/lib/guava-16.0.1.jar:/ycsb/cassandra-binding/lib/metrics-core-3.1.2.jar:/ycsb/cassandra-binding/lib/netty-buffer-4.0.33.Final.jar:/ycsb/cassandra-binding/lib/netty-codec-4.0.33.Final.jar:/ycsb/cassandra-binding/lib/netty-common-4.0.33.Final.jar:/ycsb/cassandra-binding/lib/netty-handler-4.0.33.Final.jar:/ycsb/cassandra-binding/lib/netty-transport-4.0.33.Final.jar:/ycsb/cassandra-binding/lib/slf4j-api-1.7.25.jar site.ycsb.Client -load -db site.ycsb.db.CassandraCQLClient -p hosts=localhost -P /ycsb/workloads/workloada -p recordcount=5000000 -s -threads 4
Command line: -load -db site.ycsb.db.CassandraCQLClient -p hosts=localhost -P /ycsb/workloads/workloada -p recordcount=5000000 -s -threads 4
YCSB Client 0.17.0

Loading workload...
Starting test.
SLF4J: Failed to load class "org.slf4j.impl.StaticLoggerBinder".
SLF4J: Defaulting to no-operation (NOP) logger implementation
SLF4J: See http://www.slf4j.org/codes.html#StaticLoggerBinder for further details.
2024-12-02 13:50:20:244 0 sec: 0 operations; est completion in 0 second 
WARNING: An illegal reflective access operation has occurred
WARNING: Illegal reflective access by io.netty.util.internal.PlatformDependent0 (file:/ycsb/cassandra-binding/lib/netty-common-4.0.33.Final.jar) to field java.nio.Buffer.address
WARNING: Please consider reporting this to the maintainers of io.netty.util.internal.PlatformDependent0
WARNING: Use --illegal-access=warn to enable warnings of further illegal reflective access operations
WARNING: All illegal access operations will be denied in a future release
Dec 02, 2024 1:50:20 PM io.netty.util.internal.PlatformDependent <clinit>
INFO: Your platform does not provide complete low-level API for accessing direct buffers reliably. Unless explicitly requested, heap buffer will always be preferred to avoid potential system unstability.
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
[...]
2024-12-02 13:50:30:201 10 sec: 60750 operations; 6074.39 current ops/sec; est completion in 13 minutes [INSERT: Count=60774, Max=389887, Min=171, Avg=593.13, 90=699, 99=1598, 99.9=4991, 99.99=80767] 
2024-12-02 13:50:40:200 20 sec: 132782 operations; 7203.92 current ops/sec; est completion in 12 minutes [INSERT: Count=72020, Max=27935, Min=314, Avg=545.78, 90=631, 99=786, 99.9=1963, 99.99=8075] 
2024-12-02 13:50:50:200 30 sec: 208060 operations; 7527.8 current ops/sec; est completion in 11 minutes [INSERT: Count=75277, Max=353791, Min=273, Avg=523.78, 90=589, 99=776, 99.9=1879, 99.99=9223] 
2024-12-02 13:51:00:200 40 sec: 280845 operations; 7278.5 current ops/sec; est completion in 11 minutes [INSERT: Count=72789, Max=171519, Min=183, Avg=541.22, 90=644, 99=787, 99.9=1784, 99.99=14031] 
2024-12-02 13:51:10:201 50 sec: 386105 operations; 10526 current ops/sec; est completion in 9 minutes [INSERT: Count=105265, Max=78847, Min=139, Avg=375.82, 90=494, 99=620, 99.9=1029, 99.99=4511] 
2024-12-02 13:51:20:200 60 sec: 481592 operations; 9548.7 current ops/sec; est completion in 9 minutes [INSERT: Count=95477, Max=118527, Min=143, Avg=413.81, 90=513, 99=641, 99.9=928, 99.99=6671] 
2024-12-02 13:51:30:199 70 sec: 570148 operations; 8855.6 current ops/sec; est completion in 9 minutes [INSERT: Count=88558, Max=120895, Min=145, Avg=446.28, 90=540, 99=656, 99.9=1081, 99.99=7671] 
2024-12-02 13:51:40:200 80 sec: 673346 operations; 10319.8 current ops/sec; est completion in 8 minutes [INSERT: Count=103200, Max=73151, Min=131, Avg=382.73, 90=496, 99=618, 99.9=887, 99.99=9431] 
2024-12-02 13:51:50:200 90 sec: 760192 operations; 8684.6 current ops/sec; est completion in 8 minutes [INSERT: Count=86847, Max=128703, Min=126, Avg=455.6, 90=550, 99=677, 99.9=1201, 99.99=7035] 
2024-12-02 13:52:00:204 100 sec: 846236 operations; 8600.96 current ops/sec; est completion in 8 minutes [INSERT: Count=86037, Max=12551, Min=219, Avg=459.37, 90=551, 99=663, 99.9=871, 99.99=1593] 
2024-12-02 13:52:10:200 110 sec: 940019 operations; 9382.05 current ops/sec; est completion in 7 minutes [INSERT: Count=93788, Max=89279, Min=146, Avg=421.04, 90=531, 99=654, 99.9=900, 99.99=6099] 
2024-12-02 13:52:20:200 120 sec: 1023310 operations; 8329.1 current ops/sec; est completion in 7 minutes [INSERT: Count=83293, Max=70143, Min=162, Avg=474.02, 90=557, 99=678, 99.9=917, 99.99=2783] 
2024-12-02 13:52:30:199 130 sec: 1112507 operations; 8919.7 current ops/sec; est completion in 7 minutes [INSERT: Count=89191, Max=99775, Min=140, Avg=442.9, 90=535, 99=673, 99.9=877, 99.99=2639] 
2024-12-02 13:52:40:200 140 sec: 1226221 operations; 11371.4 current ops/sec; est completion in 7 minutes [INSERT: Count=113721, Max=83391, Min=140, Avg=347.64, 90=468, 99=586, 99.9=744, 99.99=10183] 
2024-12-02 13:52:50:199 150 sec: 1330911 operations; 10469 current ops/sec; est completion in 6 minutes [INSERT: Count=104687, Max=96575, Min=144, Avg=377.46, 90=458, 99=575, 99.9=744, 99.99=5163] 
2024-12-02 13:53:00:200 160 sec: 1429486 operations; 9857.5 current ops/sec; est completion in 6 minutes [INSERT: Count=98587, Max=69439, Min=164, Avg=400.33, 90=482, 99=584, 99.9=885, 99.99=47295] 
2024-12-02 13:53:10:200 170 sec: 1525435 operations; 9594.9 current ops/sec; est completion in 6 minutes [INSERT: Count=95939, Max=62367, Min=158, Avg=412.09, 90=514, 99=640, 99.9=897, 99.99=6455] 
2024-12-02 13:53:20:200 180 sec: 1615290 operations; 8985.5 current ops/sec; est completion in 6 minutes [INSERT: Count=89852, Max=153983, Min=152, Avg=440.04, 90=540, 99=674, 99.9=891, 99.99=4795] 
2024-12-02 13:53:30:199 190 sec: 1694356 operations; 7906.6 current ops/sec; est completion in 6 minutes [INSERT: Count=79075, Max=120575, Min=126, Avg=499.91, 90=608, 99=768, 99.9=978, 99.99=5435] 
2024-12-02 13:53:40:200 200 sec: 1789336 operations; 9498 current ops/sec; est completion in 5 minutes [INSERT: Count=94971, Max=56255, Min=140, Avg=416.55, 90=540, 99=664, 99.9=909, 99.99=4403] 
2024-12-02 13:53:50:199 210 sec: 1880238 operations; 9090.2 current ops/sec; est completion in 5 minutes [INSERT: Count=90902, Max=98047, Min=134, Avg=434.63, 90=544, 99=660, 99.9=962, 99.99=5379] 
2024-12-02 13:54:00:199 220 sec: 1968551 operations; 8831.3 current ops/sec; est completion in 5 minutes [INSERT: Count=88310, Max=116607, Min=199, Avg=447.37, 90=526, 99=654, 99.9=996, 99.99=7155] 
2024-12-02 13:54:10:200 230 sec: 2057144 operations; 8859.3 current ops/sec; est completion in 5 minutes [INSERT: Count=88602, Max=117375, Min=132, Avg=446.31, 90=543, 99=661, 99.9=894, 99.99=4279] 
2024-12-02 13:54:20:200 240 sec: 2155348 operations; 9820.4 current ops/sec; est completion in 5 minutes [INSERT: Count=98197, Max=120447, Min=120, Avg=402.71, 90=509, 99=654, 99.9=892, 99.99=11031] 
2024-12-02 13:54:30:199 250 sec: 2259367 operations; 10401.9 current ops/sec; est completion in 5 minutes [INSERT: Count=104020, Max=168703, Min=164, Avg=380.23, 90=456, 99=563, 99.9=706, 99.99=1474] 
2024-12-02 13:54:40:199 260 sec: 2366597 operations; 10723 current ops/sec; est completion in 4 minutes [INSERT: Count=107230, Max=101439, Min=144, Avg=368.92, 90=447, 99=567, 99.9=718, 99.99=3795] 
2024-12-02 13:54:50:199 270 sec: 2471377 operations; 10478 current ops/sec; est completion in 4 minutes [INSERT: Count=104778, Max=95167, Min=151, Avg=377.41, 90=453, 99=565, 99.9=728, 99.99=2653] 
2024-12-02 13:55:00:199 280 sec: 2578823 operations; 10744.6 current ops/sec; est completion in 4 minutes [INSERT: Count=107448, Max=65727, Min=126, Avg=368.18, 90=445, 99=555, 99.9=730, 99.99=34879] 
2024-12-02 13:55:10:199 290 sec: 2676155 operations; 9733.2 current ops/sec; est completion in 4 minutes [INSERT: Count=97328, Max=42079, Min=176, Avg=406.34, 90=516, 99=650, 99.9=797, 99.99=3451] 
2024-12-02 13:55:20:199 300 sec: 2777412 operations; 10125.7 current ops/sec; est completion in 4 minutes [INSERT: Count=101262, Max=60063, Min=163, Avg=390.34, 90=490, 99=620, 99.9=822, 99.99=6103] 
2024-12-02 13:55:30:200 310 sec: 2867511 operations; 9009.9 current ops/sec; est completion in 3 minutes [INSERT: Count=90097, Max=162687, Min=211, Avg=439, 90=540, 99=652, 99.9=889, 99.99=6687] 
2024-12-02 13:55:40:199 320 sec: 2962161 operations; 9465 current ops/sec; est completion in 3 minutes [INSERT: Count=94649, Max=175615, Min=135, Avg=417.51, 90=503, 99=628, 99.9=794, 99.99=1540] 
2024-12-02 13:55:50:199 330 sec: 3062906 operations; 10074.5 current ops/sec; est completion in 3 minutes [INSERT: Count=100743, Max=82943, Min=173, Avg=392.27, 90=487, 99=612, 99.9=782, 99.99=4067] 
2024-12-02 13:56:00:199 340 sec: 3148909 operations; 8600.3 current ops/sec; est completion in 3 minutes [INSERT: Count=86002, Max=145151, Min=149, Avg=460.05, 90=563, 99=679, 99.9=870, 99.99=4715] 
2024-12-02 13:56:10:200 350 sec: 3234322 operations; 8541.3 current ops/sec; est completion in 3 minutes [INSERT: Count=85416, Max=4443, Min=246, Avg=462.44, 90=546, 99=676, 99.9=877, 99.99=1673] 
2024-12-02 13:56:20:200 360 sec: 3325242 operations; 9092 current ops/sec; est completion in 3 minutes [INSERT: Count=90926, Max=136319, Min=170, Avg=434.84, 90=514, 99=656, 99.9=833, 99.99=1789] 
2024-12-02 13:56:30:200 370 sec: 3436689 operations; 11144.7 current ops/sec; est completion in 2 minutes [INSERT: Count=111443, Max=101631, Min=161, Avg=354.82, 90=432, 99=523, 99.9=633, 99.99=9423] 
2024-12-02 13:56:40:199 380 sec: 3545952 operations; 10926.3 current ops/sec; est completion in 2 minutes [INSERT: Count=109258, Max=152447, Min=154, Avg=361.99, 90=441, 99=541, 99.9=665, 99.99=1417] 
2024-12-02 13:56:50:199 390 sec: 3642956 operations; 9700.4 current ops/sec; est completion in 2 minutes [INSERT: Count=97001, Max=115455, Min=164, Avg=407.52, 90=493, 99=604, 99.9=739, 99.99=6011] 
2024-12-02 13:57:00:199 400 sec: 3753545 operations; 11058.9 current ops/sec; est completion in 2 minutes [INSERT: Count=110593, Max=57119, Min=135, Avg=357.72, 90=439, 99=544, 99.9=670, 99.99=37919] 
2024-12-02 13:57:10:199 410 sec: 3862873 operations; 10932.8 current ops/sec; est completion in 2 minutes [INSERT: Count=109328, Max=50335, Min=180, Avg=362.18, 90=446, 99=553, 99.9=706, 99.99=10535] 
2024-12-02 13:57:20:200 420 sec: 3957088 operations; 9421.5 current ops/sec; est completion in 1 minute [INSERT: Count=94212, Max=55999, Min=173, Avg=419.89, 90=515, 99=631, 99.9=830, 99.99=2233] 
2024-12-02 13:57:30:199 430 sec: 4063916 operations; 10682.8 current ops/sec; est completion in 1 minute [INSERT: Count=106828, Max=127871, Min=154, Avg=370.47, 90=454, 99=609, 99.9=832, 99.99=1598] 
2024-12-02 13:57:40:199 440 sec: 4166602 operations; 10268.6 current ops/sec; est completion in 1 minute [INSERT: Count=102688, Max=131455, Min=122, Avg=385.27, 90=464, 99=568, 99.9=744, 99.99=4023] 
2024-12-02 13:57:50:199 450 sec: 4279785 operations; 11318.3 current ops/sec; est completion in 1 minute [INSERT: Count=113182, Max=93183, Min=131, Avg=349.54, 90=429, 99=523, 99.9=683, 99.99=6903] 
2024-12-02 13:58:00:199 460 sec: 4395878 operations; 11609.3 current ops/sec; est completion in 1 minute [INSERT: Count=116094, Max=65599, Min=136, Avg=340.65, 90=415, 99=524, 99.9=649, 99.99=829] 
2024-12-02 13:58:10:199 470 sec: 4481209 operations; 8533.1 current ops/sec; est completion in 55 seconds [INSERT: Count=85332, Max=133503, Min=211, Avg=463.4, 90=558, 99=703, 99.9=889, 99.99=4359] 
2024-12-02 13:58:20:199 480 sec: 4580929 operations; 9972 current ops/sec; est completion in 44 seconds [INSERT: Count=99720, Max=151167, Min=191, Avg=396.42, 90=473, 99=589, 99.9=742, 99.99=1275] 
2024-12-02 13:58:30:199 490 sec: 4679379 operations; 9845 current ops/sec; est completion in 34 seconds [INSERT: Count=98449, Max=166527, Min=192, Avg=401.6, 90=497, 99=605, 99.9=785, 99.99=1509] 
2024-12-02 13:58:40:199 500 sec: 4759218 operations; 7983.9 current ops/sec; est completion in 26 seconds [INSERT: Count=79839, Max=211711, Min=251, Avg=495.23, 90=574, 99=693, 99.9=907, 99.99=1742] 
2024-12-02 13:58:50:199 510 sec: 4845522 operations; 8630.4 current ops/sec; est completion in 17 seconds [INSERT: Count=86304, Max=169855, Min=174, Avg=458.37, 90=562, 99=674, 99.9=859, 99.99=1546] 
2024-12-02 13:59:00:199 520 sec: 4949963 operations; 10444.1 current ops/sec; est completion in 6 second [INSERT: Count=104443, Max=144767, Min=168, Avg=378.88, 90=449, 99=565, 99.9=735, 99.99=83391] 
2024-12-02 13:59:10:199 530 sec: 5000000 operations; 5003.7 current ops/sec; [CLEANUP: Count=3, Max=38, Min=4, Avg=15.67, 90=38, 99=38, 99.9=38, 99.99=38] [INSERT: Count=50028, Max=67135, Min=194, Avg=394.54, 90=467, 99=570, 99.9=726, 99.99=4219] 
2024-12-02 13:59:10:444 530 sec: 5000000 operations; 0 current ops/sec; [CLEANUP: Count=1, Max=2250751, Min=2248704, Avg=2249728, 90=2250751, 99=2250751, 99.9=2250751, 99.99=2250751] [INSERT: Count=0, Max=0, Min=9223372036854775807, Avg=NaN, 90=0, 99=0, 99.9=0, 99.99=0] 
[OVERALL], RunTime(ms), 530245
[OVERALL], Throughput(ops/sec), 9429.603296589312
[TOTAL_GCS_G1_Young_Generation], Count, 60
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 462
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.08712953446048524
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 60
[TOTAL_GC_TIME], Time(ms), 462
[TOTAL_GC_TIME_%], Time(%), 0.08712953446048524
[CLEANUP], Operations, 4
[CLEANUP], AverageLatency(us), 562443.75
[CLEANUP], MinLatency(us), 4
[CLEANUP], MaxLatency(us), 2250751
[CLEANUP], 95thPercentileLatency(us), 2250751
[CLEANUP], 99thPercentileLatency(us), 2250751
[INSERT], Operations, 5000000
[INSERT], AverageLatency(us), 414.3401822
[INSERT], MinLatency(us), 120
[INSERT], MaxLatency(us), 389887
[INSERT], 95thPercentileLatency(us), 567
[INSERT], 99thPercentileLatency(us), 664
[INSERT], Return=OK, 5000000
======================================================
Warm up is done.
======================================================